app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Hello"], ["created_at", "2020-12-10 11:49:09.316973"], ["updated_at", "2020-12-10 11:49:09.316973"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "link" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["link", "https://www.amazon.jobs/en/jobs/1332478/amazon-future-leaders-leap-intern-program"], ["updated_at", "2020-12-10 12:34:18.591245"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)